---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopySelection
source: html/c0584cc9-b702-e650-ec1c-dc054450f639.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopySelection Property

Cannot copy selection.[Description]

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotCopySelection { get; }
```